package main

/**
1，算法对个人的意义
	项目中算法的应用很多 redis的LRU策略，大数据中的TOPk问题，mysql的B+树索引等；但是“我这些年从来没有用过算法，除了出去面试的时候”之类的话，这些想法是有问题的；
	算法问题的规模比较小，工作中稍微大一点的项目没法随意改变代码结构，甚至牺牲整体性能和代码的简洁优雅去满足业务需求，这样算法就能锻炼出你编写最好代码实现的能力
	算法没有图形界面，文本输入 文本输出，你可以专注去解决问题，抛开mvc框架 抛开其他影响去写核心代码
	算法 会锻炼你对时间和内存的预判，提高对逻辑即IE狗欧复杂的程序的性能的预测能力
	算法是coding能力的提升的最好方式，练习算法过程中能和别的优秀的程序员交流，读懂别人的思考过程，难受是过程不是目的
2，算法问题汇总
	写算法 最怕出错，重复的错误而没有吸取教训
		递归：死循环 内存泄漏，递归需要堆栈，内存消耗比非递归代码要大的多，递归深度太大内存会出现飙升
		访问数组越界 区间表意不明(左右开闭区间)
		特殊值处理 0 1 规律和其他数不一样的时候需要特殊处理
3，我认为leetcode前200题是相当经典的。可能大家不知道，早期leetcode总共也就一百来道题。这些题目基本都是精华，后面的很多题目都是在这些题目的基础上进行演化而成








 */
